---
## 5. Some examples and applications

In [ ]:
  #VERSION 1.0 
# #DATE 15-12-2023 
# #FALLOU FALL EAE MASTER BIG DATA ANALYTICS 
#SOURCE:https://github.com/FallouFall/EaePython- 
# #Prof : M.Domingo Domenech, Enric

#### Ex 1.

Create a DataFrame from the following dictionary:

In [1]:
users = {
    "id"         : list (range (1 , 21)) ,
    "name"       : [ "John" , "Jane" , "Alice" , "Bob" , "Eve" , "Jack" , "Jill" , "Kate" , "Mark" , "Paul" , "Bob" ,
                     "Alice" , "Jane" , "John" , "John" , "Alice" , "Jane" , "John" , "Alice" , "Jane" ] ,
    "telephone"  : [ "123456789" , "987654321" , "123123123" , "456456456" , "789789789" , "321321321" , "654654654" ,
                     "987987987" , "159159159" , "753753753" , "637838399" , "123456789" , "987654321" , "123123123" ,
                     "456456456" , "789789789" , "321321321" , "654654654" , "987987987" , "159159159" ] ,
    "has_car"    : [ True , True , False , True , False , True , False , True , False , True , False , False , False ,
                     True , True , False , False , False , True , True ] ,
    "birth_date" : [ "1980-01-01" , "1981-02-02" , "1982-03-03" , "1983-04-04" , "1984-05-05" , "1985-06-06" ,
                     "1986-07-07" , "1987-08-08" , "1988-09-09" , "1989-10-10" , "2001-01-01" , "2002-02-02" ,
                     "2003-03-03" , "2004-04-04" , "2005-05-05" , "2006-06-06" , "2007-07-07" , "2008-08-08" ,
                     "2009-09-09" , "2010-10-10" ] ,
    "city"       : [ "Barcelona" , "Paris" , "London" , "Madrid" , "Rome" , "Pekin" , "Amsterdam" , "Lima" , "Lisbon" ,
                     "Kigali" , "Barcelona" , "Paris" , "London" , "Madrid" , "Rome" , "Pekin" , "Amsterdam" , "Lima" ,
                     "Lisbon" , "Kigali" ] ,
    }

In [2]:
  # Your code here
import pandas as pd
import numpy as np

df = pd.DataFrame.from_dict (users , orient = 'index').T
df

    id   name  telephone has_car  birth_date       city
0    1   John  123456789    True  1980-01-01  Barcelona
1    2   Jane  987654321    True  1981-02-02      Paris
2    3  Alice  123123123   False  1982-03-03     London
3    4    Bob  456456456    True  1983-04-04     Madrid
4    5    Eve  789789789   False  1984-05-05       Rome
5    6   Jack  321321321    True  1985-06-06      Pekin
6    7   Jill  654654654   False  1986-07-07  Amsterdam
7    8   Kate  987987987    True  1987-08-08       Lima
8    9   Mark  159159159   False  1988-09-09     Lisbon
9   10   Paul  753753753    True  1989-10-10     Kigali
10  11    Bob  637838399   False  2001-01-01  Barcelona
11  12  Alice  123456789   False  2002-02-02      Paris
12  13   Jane  987654321   False  2003-03-03     London
13  14   John  123123123    True  2004-04-04     Madrid
14  15   John  456456456    True  2005-05-05       Rome
15  16  Alice  789789789   False  2006-06-06      Pekin
16  17   Jane  321321321   False  2007-07-07  Amsterdam
17  18   John  654654654   False  2008-08-08       Lima
18  19  Alice  987987987    True  2009-09-09     Lisbon
19  20   Jane  159159159    True  2010-10-10     Kigali

#### Ex 2. 

Use the previous Users DataFrame to answer the following questions:

- How many users are there?
- How many users have a car?
- What is the average age of the users?
- What is the most common name?
- What is the most common city?

In [96]:
  # Your code here

In [1]:
import datetime

#shape also work shape()[0]
print (f"Number of users:{len (df)}")
print (f"Number of users Who have Cars:{df.has_car.sum ( )}")
listofBirth = df [ 'birth_date' ]
listDate = [ ]
for this in listofBirth :
    listDate.append (datetime.date (*(int (x) for x in this.split ('-'))))
listAges = [ ]
#print(listDate)
todayDate = datetime.date.today ( )
for this in listDate :
    listAges.append (todayDate.year - this.year - ((todayDate.month , todayDate.day) < (this.month , this.day)))
arrayAge = np.array (listAges)
print (f"Average Age:{arrayAge.mean ( )}")
print (f"\n Most Common  {df [ 'name' ].value_counts ( ).nlargest (1)} ")
print (f"\n Most Common  {df [ 'city' ].value_counts ( ).nlargest (1)}")

NameError: name 'df' is not defined

#### Ex 3.

Create a new column in the previous DataFrame called "Continent" based on the city of each user. You can start by checking the unique countries and building a list of the countries for each continent. Then you can use the apply() method to apply a function to each row of the DataFrame to get the continent of each user.

In [ ]:
  # Your code here

In [7]:
listOfContinent = {
    "Barcelona" : "Europe" ,
    "Paris"     : "Europe" ,
    "London"    : "Europe" ,
    "Madrid"    : "Europe" ,
    "Rome"      : "Europe" ,
    "Amsterdam" : "Europe" ,
    "Lisbon"    : "Europe" ,
    "Kigali"    : "Africa" ,
    "Pekin"     : "Asia" ,
    "Lima"      : "South America" ,
    }


# cant create a map corretly so i find the corresponding value on the city in the disctionnary

def findContinent(country) :
    return listOfContinent.get (country)


# print(findContinent('Kigali'))
df [ 'Continent' ] = df [ 'city' ].apply (findContinent)
df

    id   name  telephone has_car  birth_date       city      Continent
0    1   John  123456789    True  1980-01-01  Barcelona         Europe
1    2   Jane  987654321    True  1981-02-02      Paris         Europe
2    3  Alice  123123123   False  1982-03-03     London         Europe
3    4    Bob  456456456    True  1983-04-04     Madrid         Europe
4    5    Eve  789789789   False  1984-05-05       Rome         Europe
5    6   Jack  321321321    True  1985-06-06      Pekin           Asia
6    7   Jill  654654654   False  1986-07-07  Amsterdam         Europe
7    8   Kate  987987987    True  1987-08-08       Lima  South America
8    9   Mark  159159159   False  1988-09-09     Lisbon         Europe
9   10   Paul  753753753    True  1989-10-10     Kigali         Africa
10  11    Bob  637838399   False  2001-01-01  Barcelona         Europe
11  12  Alice  123456789   False  2002-02-02      Paris         Europe
12  13   Jane  987654321   False  2003-03-03     London         Europe
13  14   John  123123123    True  2004-04-04     Madrid         Europe
14  15   John  456456456    True  2005-05-05       Rome         Europe
15  16  Alice  789789789   False  2006-06-06      Pekin           Asia
16  17   Jane  321321321   False  2007-07-07  Amsterdam         Europe
17  18   John  654654654   False  2008-08-08       Lima  South America
18  19  Alice  987987987    True  2009-09-09     Lisbon         Europe
19  20   Jane  159159159    True  2010-10-10     Kigali         Africa

#### Ex 4. 

Save the modified DataFrame to a csv file called `users_processed.csv` without the index column.

In [ ]:
  # Your code here

In [8]:

df.to_csv ("users_processed.csv" , index = False)